# ExtensibleStorageFilter Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExtensibleStorageFilter Constructor
ExtensibleStorageFilter Class See Also
---
Constructs a new instance of a filter to match elements with extensible storage data based on specific Schema id.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExtensibleStorageFilter(
	Guid schemaGuid
)
```

Visual Basic
---
```text
Public Sub New ( _
	schemaGuid As Guid _
)
```

Visual C++
---
```text
public:
ExtensibleStorageFilter(
	Guid schemaGuid
)
```

# ### Parameters
schemaGuid
    Type: System..::..Guid Schema id used to filter elements with extensible storage data
# See Also
ExtensibleStorageFilter Class
Autodesk.Revit.DB.ExtensibleStorage Namespace